{
  "versions": [
    {
      "version": "1.0.0-MVP",
      "date": "26.04.2023",
      "note": "<h3>New Features:</h3><ul><li>HealthDataCloud initial production version customized from Indoc Pilot Version 2.2.0</li><li>The Portal now provides the ability to resume a large file upload already in progress so if the upload fails, you don’t have to restart the upload from the beginning.</li><li>Platform users can receive platform and pipeline execution notifications in the Newsfeed on the Portal Dashboard right after login.</li></ul><h3>Improvements:</h3><ul><li>Extended Portal zip contents previewer to support additional zip file types.</li><li>Integrated Server Sent Event (SSE) strategy to stream Project & Dataset file status for more lightweight Backend services.</li><li>Improved data uploading process by implementing metadata pre-registration workflow to support resumable file uploads.</li></ul><h3>Bug Fixes:</h3><ul><li>Fixed a bug that caused failure when simultaneously importing a file and folder into a Dataset.</li><li>Fixed a bug that caused downloaded Dataset to contain the wrong file structure.</li></ul>"
    },
    {
      "version": "1.0.0",
      "date": "29.09.2023",
      "note": "<h3>New Features:</h3><ul><li>Integration with EBRAINS Knowledge Graph (KG): Users can now directly interact with the EBRAINS KG through the Platform user interface (UI):</li><ul><li>Create dedicated KG Spaces for Datasets via the Dataset UI.</li><li>Upload openMINDS schema instances directly to KG Spaces through the Dataset UI.</li><li>Access permissions for KG Spaces are automatically mapped to the permissions of the corresponding HDC Project members.</li><li>Changes to Project membership are automatically propagated to reflect updated permissions in associated KG Spaces.</li></ul><li>The Platform Support contact form is now integrated with the EBRAINS Support System for seamless user assistance.</li><li>Virtual Machines (VMs) are now available as Workspace Tools for Projects, enhancing computational flexibility.</li></ul><h3>Improvements:</h3><ul><li>Release of the full User Guide to provide comprehensive support for platform users.</li><li>Upgraded the Workspace Tool XWiki to enable access to the \"WYSIWYG\" editor mode for easier content creation.</li><li>Integrated monitoring of non-sensitive platform metrics via the centralized EBRAINS monitoring system for improved operational oversight.</li><li>The latest version of pilotcli, the Platform’s Command Line Interface (CLI), is now pre-installed and readily available in all Workspace VMs and JupyterHub environments.</li><li>Refined several user notifications to include direct links to relevant User Guide articles for enhanced usability.</li></ul><h3>Bug Fixes:</h3><ul><li>Fixed an issue where the \"Last time logged in\" was not displayed correctly on both the user Account page and the Platform Administration table.</li><li>Resolved an issue with platform-wide notification banners that displayed scheduled maintenance times incorrectly due to UTC-to-local timezone conversion errors.</li><li>Fixed a bug where the BIDS Validator in the Dataset interface failed to display results if validation was unsuccessful.</li><li>Addressed inconsistencies in file and folder structures of Datasets upon download.</li></ul>"
    },
    {
      "version": "1.1.0",
      "date": "15.05.2024",
      "note": "<h3>New Feature:</h3><ul><li>Management of Workspace VM-specific credentials: Users can now manage their Workspace VM-specific credentials fully self-served. This includes creation, reset, and change of their Workspace VM password</li></ul><h3>Improvements:</h3><ul><li>Removing a user from a Project automatically disables their access to all Workspace VMs of that Project</li><li>Failed upload events are now sorted from most recent to oldest for resumable upload</li><li>Failed upload events are now deleted after 24 hours</li></ul><h3>Bug Fixes:</h3><ul><li>Fixed the bug that caused failure of direct Project invitation for new EBRAINS users</li><li>Fixed the bug that caused failure of updating users permissions in EBRAINS Collabs for Datasets with enabled Knowledge Graph integration service in cases with too many Datasets per Project</li><li>Fixed the bug that prevented Project Admins from completing their own Guacamole access request</li></ul>"
    },
    {
      "version": "1.2.0",
      "date": "30.09.2024",
      "note": "<h3>New Features:</h3><ul><li>Enhancements to integration with EBRAINS Knowledge Graph (KG) via the HDC Dataset user interface:<ul><li>Users can now delete openMINDS metadata instances in both HDC Dataset and/or in the associated KG space</li><li>Users can now download openMINDS metadata instances into HDC Datasets from KG by providing the KG UUID</li><li>Users can now push the latest version of an openMINDS metadata instance from HDC Datasets to the associated KG Space</li><li>Users can now pull the latest version of an openMINDS metadata instance from KG to the HDC Dataset</li><li>User interactions with EBRAINS KG integration are now logged in the Activity tab of HDC Datasets</li></ul></li><li>Access to Datasets by Project Administrators: Project Administrators can now view, access, and interact with all Datasets associated with their Project, even if it was created by a different user</li></ul><h3>Improvements:</h3><ul><li>Project Administrators can now filter lists of accessible Datasets to see only those they created, or to include those created by members of their Project, both via the platform user interface and via the command line interface</li><li>Enhanced performance and user experience through reduced build times for the platform frontend and improved error handling</li><li>Increased overall security by updating several components to address vulnerabilities. This includes upgrades of some Workspace Tools:<ul><li>JupyterHub was upgrade to version 4.0.2</li><li>JupyterLab was upgraded to version 4.0.7</li><li>XWiki was upgraded to version 16.6.0</li></ul></li><li>Improved response time and incident management capabilities through upgraded CI/CD pipelines and enhanced alerting based on platform system metrics monitoring</li><li>Started enforcing resource limits of Workspace Tools to ensure reliable platform operation</li></ul><h3>Bug Fixes:</h3><ul><li>Fixed the bug that prevented deletion of files from Metadata tab of Datasets</li><li>Fixed the bug that prevented correct display of the Terms of Use upon first login</li></ul>"
    },
    {
      "version": "1.3.0",
      "date": "22.11.2024",
      "note": "<h3>New Features:</h3><ul><li>All registered EBRAINS users can now join the HealthDataCloud Test Project on a self-serve basis, allowing them to explore the HealthDataCloud central node platform features.</li><li>Association between a Dataset and a Project is now being made upon Dataset creation.</li><li>Users can now filter lists of accessible Datasets by Project they are associated to.</li></ul><h3>Improvements:</h3><ul><li>When adding data to a Dataset from the core zone of a Project, only those Datasets that are associated with the corresponding Project are shown, not all Datasets across Projects the user has access to.</li><li>Introduced enhanced logging capabilities by enabling \"Audit\" log levels acroess all services for improved traceability and accountability.</li><li>Refined error messages in the Command Line Interface (pilotcli) to provide more detailed and user-friendly guidance during platform interactions.</li><li>Increased platform security through component updates to address vulnerabilities.</li></ul><h3>Bug Fixes:</h3><ul><li>Resolved inconsistent references to openMINDS schema instances across the platform.</li><li>Fixed the issue that prevented seamless switching between zones in the Project Search interface.</li><li>Added additional health checks to ensure service availability following partial or complete cluster restarts.</li></ul>"
    },
    {
      "version": "1.4.0",
      "date": "08.04.2025",
      "note": "<h3>New Features:</h3><ul><li>Dataset Sharing between Projects within the Platform:<ul><li>Project Administrators can now share specific versions of a Dataset with other Projects by sending a sharing request directly through the user interface.</li><li>Project Administrators of the recipient Project can review and process these requests via a newly added Requests tab in their Project view.</li><li>All interactions related to Dataset sharing are logged in the Activity tab of the Dataset UI. Sharing requests and their processing status are persistently visible in the Requests tab of the recipient Project.</li></ul></li><li>New UI elements now allow users to bulk-synchronize all openMINDS metadata between a Dataset within the Platform and the EBRAINS Knowledge Graph in a single action.</li><li>The use of identity management and role-based access control (RBAC) was expanded to further strengthen security and ensure consistent access policies across all components of the system.</li></ul><h3>Improvements:</h3><ul><li>Enhanced and refined metrics collection and log retention policies across key platform components to improve system observability, ensure log availability, and support proactive issue detection.</li><li>Improved the responsiveness and efficiency of the Platform Portal while reducing resource consumption, contributing to a smoother user experience.</li><li>Simplified the deployment and maintenance processes across core Platform services by consolidating and standardizing configuration management, reducing operational complexity and improving consistency.</li></ul><h3>Bug Fixes:</h3><ul><li>Rolled out the latest version of pilotcli (v2.2.7) across all Workspace Tools.</li></ul>"
    },
    {
      "version": "1.5.0",
      "date": "25.09.2025",
      "note": "<h3>New Features:</h3><ul><li>Download origin indicator: To strengthen security and monitoring for Project members, each \"download\" action now shows whether data was retrieved internally (within the Platform, e.g., to Workspace Tools such as JupyterHub or a Workspace VM) or externally.<ul><li>Applies to downloads initiated via both the Platform UI and the pilotcli.</li><li>Logged in the Activity streams of both Projects and Datasets.</li><li>Note: Only the \"internal\" vs \"external\" status is displayed; no IP addresses are revealed.</li></ul></li><li>Automated end-to-end testing: A comprehensive test suite now runs every 8 hours, covering major Platform features and triggering tight alerting mechanisms if errors occur.</li></ul><h3>Improvements:</h3><ul><li>Dataset sharing: Shared Dataset content is no longer delivered as a .zip archive. Instead, the full folder structure is recreated in the recipient Project Green Room.</li><li>Deployment and configuration: Refactored automated pipelines to reduce stack complexity and dependency surface.</li><li>Image registry hardening: Expanded the private image registry coverage for platform-critical service images to reduce reliance on external sources.</li><li>Monitoring: Extended non-sensitive performance metrics collection to Workspace VM services.</li></ul><h3>Bug Fixes:</h3><ul><li>Fixed a rendering issue affecting certain XWiki plugins.</li></ul>"
    },
    {
      "version": "1.6.0",
      "date": "16.02.2026",
      "note": "<h3>New Features:</h3><ul><li>File &amp; Folder deletion and restoration:<ul><li>Project members can now delete and restore files and folders directly via the Portal UI.</li><li>From the Project zones Green Room and Core, Project members can move files and folders to the Trash Bin and restore them to their original location when needed. Visibility and access permissions in the Trash Bin are governed by the Platform’s RBAC policies.</li><li>Only Project Administrators can mark items in the Trash Bin for permanent deletion. Marked items are automatically deleted after a grace period of 30 days.</li><li>Via the User Account page, Project Administrators can review an overview of items marked for permanent deletion, including when they were marked. Until the grace period expires, items can be restored (back to the Trash Bin and from there to the Project zone) or permanently deleted immediately.</li><li><strong>Note:</strong> For forensic and compliance purposes, general retention policies apply to basic metadata (e.g., unique file/folder IDs) and audit logs after permanent deletion.</li></ul></li></ul><h3>Improvements:</h3><ul><li>Search UI enhancements: Refined and streamlined the Search UI and aligned it with the new file/folder deletion workflows.</li><li>Interoperability preparations (Pilot-HDC central node &amp; Pilot-HDC-lite satellite nodes): Implemented foundational changes to support interoperable deployments across central and satellite nodes, including configurable Portal behavior and more flexible deployment configuration.</li><li>Security: Implemented additional hardening measures for platform isolation and access control, including improved safeguards for CI/CD job execution.</li><li>Governance: Expanded audit logging coverage across Platform services to improve traceability and accountability.</li></ul><h3>Bug Fixes:</h3><ul><li>Fixed an issue affecting resumable upload when large numbers of files were temporarily stored for recovery.</li><li>Fixed an SSL certificate issue affecting the platform ingress/proxy configuration.</li></ul>"
    }
  ]
}
